trunk/app/controllers/resources_controller.rb

  def index
    @resources = Resource.all
---
SELECT * FROM `resources`

  def show
    @resource = Resource.find(params[:id])
---
SELECT * FROM `resources` WHERE (`resources`.`id` = 1)

  def capture
    items_array = items
    items_array.each do |url|
      doc = Nokogiri::HTML(open(url))
      attributes = {:url => url, :title => doc.xpath('//title').inner_text.strip, :content => cleanup_plain_text(doc.inner_text) }
      old = Resource.find(:first,:conditions => ['url = ?',url])
      if(old)
        old.update_attributes(attributes)
      else
        resource = Resource.new(attributes)
        resource.save
---
SELECT `resources`.id FROM `resources` WHERE (`resources`.`url` = BINARY 'http://radicaos.com' AND `resources`.id <> 1) LIMIT 1
UPDATE `resources` SET `content` = 'RADICAOS - Anarco | Vegan | Straight Edge Quem espera sempre alcança, cambada. Tá demorando, mas o site vai sair com tudo! Aguardem, e não esqueçam de deixar um recado e conferir os zines. Paz e anarquia! Saiu o Zine REVIVA 3!Clique aqui para baixar! Downloads: (562) Zine REVIVA 2! Downloads: (328) Zine REVIVA 1! Downloads: (794) Nome: E-mail: Damião Experiença :: WebMailPegue o V :: Terra Sem Lei ', `updated_at` = '2010-04-19 15:00:04' WHERE `id` = 1
INSERT INTO `resources` (`updated_at`, `title`, `url`, `content`, `captured_at`, `created_at`) VALUES('2010-04-19 13:58:43', 'RADICAOS - Anarco | Vegan | Straight Edge', 'http://radicaos.com', 'RADICAOS - Anarco | Vegan | Straight Edge\r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n Quem espera sempre alcança, cambada. Tá demorando, mas o site vai sair com tudo! Aguardem, e não esqueçam de deixar um recado e conferir os zines. Paz e anarquia!\r\n \r\n Saiu o Zine REVIVA 3!Clique aqui para baixar!\r\n \r\n Downloads: (562)\r\n \r\n \r\n \r\n Zine REVIVA 2!\r\n \r\n Downloads: (328) \r\n \r\n \r\n Zine REVIVA 1!\r\n \r\n Downloads: (794) \r\n \r\n \r\n \r\n \r\n \r\n Nome: \r\n E-mail: \r\n \r\n \r\n \r\n \r\n \r\n \r\n\r\n	\r\n \r\n \r\n Damião Experiença :: \r\n WebMailPegue o V :: \r\n Terra Sem Lei\r\n \r\n \r\n', NULL, '2010-04-19 13:58:43')

  def search
    @resources = Resource.find(:all,:conditions =>['content LIKE ?','%'+params[:term]+'%'])
---
SELECT * FROM `resources` WHERE (content LIKE '%mundo das trevas%')