trunk/oinker/app/controllers/tweeters_controller.rb

SELECT * FROM `tweeters`
---
  def index
    @tweeters = Tweeter.all

SELECT * FROM `tweeters` WHERE (`tweeters`.`id` = 1)
INSERT INTO `tweeters` (`created_at`, `friends_count`, `profile_image_url`, `followers_count`, `screen_name`, `location`, `geo_enabled`, `time_zone`, `protected`, `description`, `profile_background_image_url`, `url`, `statuses_count`, `updated_at`) VALUES('2009-02-13 14:05:56', 18883, 'http://a1.twimg.com/profile_images/842733876/AVATAR_lado_normal.jpg', 62500, 'MussumAlive', 'Buteco do Polaco', 0, 'Brasilia', 0, 'Homenagem ao Humorista Mussum, feita por Leandro Santos - Contato: mussumalive@bebidaliberada.com.br', 'http://a3.twimg.com/profile_background_images/84393589/twitter_mussum.jpg', 'http://www.bebidaliberada.com.br', 13524, '2010-06-10 23:03:03')
INSERT INTO `tweets` (`created_at`, `tweeter_id`, `twitter_id`, `text`, `source`, `in_reply_to_status_id`, `in_reply_to_screen_name`, `updated_at`) VALUES('2010-05-26 16:08:16', 1, 14772828826, 'RT: @SitePalmeiras: PROMOÇÃO! Dê RT nesse tweet e concorra a um guia oficial da Copa do Mundo da Fifa! http://migre.me/IL5j', '<a href=\"http://www.echofon.com/\" rel=\"nofollow\">Echofon</a>', NULL, NULL, '2010-06-10 23:02:46')
SELECT `tweets`.id FROM `tweets` WHERE (`tweets`.`twitter_id` = 15287859627) LIMIT 1
UPDATE `tweeters` SET `followers_count` = 31398, `description` = 'Previsões hilárias, sabedorias nada sábias, horóscopo de uma forma bem cômica e mais algumas besteiras só aqui no @Zodiacando', `updated_at` = '2010-06-11 00:41:24' WHERE `id` = 12
SELECT `tweeters`.id FROM `tweeters` WHERE (`tweeters`.`screen_name` = BINARY 'terrasemlei' AND `tweeters`.id <> 2) LIMIT 1
---
  def show
    @tweeter = Tweeter.find(params[:id])

    client = Grackle::Client.new
    @tweets = []
    t_tweets = client.statuses.user_timeline.json?(:screen_name => @tweeter.screen_name)
    t_tweets.each do |t_tweet|
      tweet = Tweet.new
      tweet.tweeter = @tweeter
      tweet.created_at = t_tweet.created_at
      tweet.twitter_id = t_tweet.id
      tweet.text = t_tweet.text
      tweet.source = t_tweet.source
      tweet.in_reply_to_status_id = t_tweet.in_reply_to_status_id
      tweet.in_reply_to_screen_name = t_tweet.in_reply_to_screen_name
      tweet = Tweet.find_by_twitter_id(tweet.twitter_id) unless tweet.save
      @tweets << tweet
    end

    t_friends = client.friends.ids.json?(:screen_name => @tweeter.screen_name)

INSERT INTO `tweeters` (`updated_at`, `url`, `description`, `protected`, `screen_name`, `geo_enabled`, `time_zone`, `friends_count`, `followers_count`, `profile_background_image_url`, `statuses_count`, `created_at`, `profile_image_url`, `location`) VALUES('2010-06-03 18:47:06', NULL, NULL, 0, 'renatofq', 0, 'Brasilia', 46, 53, 'http://s.twimg.com/a/1274899949/images/themes/theme2/bg.gif', 159, '2009-04-08 12:40:24', 'http://a3.twimg.com/profile_images/346768073/twitterProfilePhoto_normal.jpg', NULL)
UPDATE `tweeters` SET `friends_count` = 45, `updated_at` = '2010-06-10 23:02:38' WHERE `id` = 1
---
  def create
    client = Grackle::Client.new
    tmp = client.users.show?(:screen_name => params[:tweeter][:screen_name])
    @tweeter = create_or_update_tweeter tmp

    if @tweeter.save