trunk/oinker/app/controllers/tweets_controller.rb

SELECT * FROM `tweets` WHERE (`tweets`.`id` = 30)
---
  def show
    @tweet = Tweet.find(params[:id])