oinker/app/controllers/big_shots_controller.rb

  def index
    @big_shots = BigShot.all
---
SELECT * FROM `big_shots`

  def show
    @big_shot = BigShot.find(params[:id])
---
SELECT * FROM `big_shots` WHERE (`big_shots`.`id` = 1)

  def create
    @big_shot = BigShot.new(params[:big_shot])

    respond_to do |format|
      if @big_shot.save
---
INSERT INTO `big_shots` (`screen_name`, `tags`, `created_at`, `updated_at`) VALUES('renatofq', 'política, esporte', '2010-08-02 08:39:57', '2010-08-02 08:39:57')