oinker/app/controllers/home_controller.rb

  def insert
    client = Grackle::Client.new
    tmp = client.users.show?(:screen_name => params[:tweeter][:screen_name])
    tweeter = Tweeter.new
    tweeter.created_at = tmp.created_at
---
INSERT INTO `tweeters` (`updated_at`, `url`, `description`, `protected`, `screen_name`, `geo_enabled`, `time_zone`, `friends_count`, `followers_count`, `profile_background_image_url`, `statuses_count`, `created_at`, `profile_image_url`, `location`) VALUES('2010-06-03 17:06:57', 'http://radicaos.com', 'Logo, eu digo: Eä! Que essas coisas Existam! E mandarei para o meio do Vazio a Chama Imperecível; e ela estará no coração do Mundo, e o Mundo Existirá.', 0, 'volmerius', 1, 'Greenland', 142, 90, 'http://a1.twimg.com/profile_background_images/44511142/eu_menor.png', 141, '2009-10-12 15:28:41', 'http://a1.twimg.com/profile_images/466714110/DSC02731_-_C_pia_-_C_pia_normal.jpg', 'Distrito Federal')