oinker/app/controllers/tweeters_controller.rb

  def index
    @tweeters = Tweeter.all
---
SELECT * FROM `tweeters`

  def show
    @tweeter = Tweeter.find(params[:id])
---
SELECT * FROM `tweeters` WHERE (`tweeters`.`id` = 1)

  def create
    client = Grackle::Client.new
    tmp = client.users.show?(:screen_name => params[:tweeter][:screen_name])
    @tweeter = Tweeter.find_by_screen_name(params[:tweeter][:screen_name])
    @tweeter = Tweeter.new if @tweeter.nil?
    @tweeter.created_at = tmp.created_at
    @tweeter.friends_count = tmp.friends_count
    @tweeter.profile_image_url = tmp.profile_image_url
    @tweeter.followers_count = tmp.followers_count
    @tweeter.screen_name = tmp.screen_name
    @tweeter.location = tmp.location
    @tweeter.geo_enabled = tmp.geo_enabled
    @tweeter.time_zone = tmp.time_zone
    @tweeter.protected = tmp.protected
    @tweeter.description = tmp.description
    @tweeter.profile_background_image_url = tmp.profile_background_image_url
    @tweeter.url = tmp.url
    @tweeter.statuses_count = tmp.statuses_count



    if @tweeter.save
---
SELECT `tweeters`.id FROM `tweeters` WHERE (`tweeters`.`screen_name` = BINARY 'renatofq' AND `tweeters`.id <> 1) LIMIT 1
INSERT INTO `tweeters` (`updated_at`, `url`, `description`, `protected`, `screen_name`, `geo_enabled`, `time_zone`, `friends_count`, `followers_count`, `profile_background_image_url`, `statuses_count`, `created_at`, `profile_image_url`, `location`) VALUES('2010-06-03 18:47:06', NULL, NULL, 0, 'renatofq', 0, 'Brasilia', 46, 53, 'http://s.twimg.com/a/1274899949/images/themes/theme2/bg.gif', 159, '2009-04-08 12:40:24', 'http://a3.twimg.com/profile_images/346768073/twitterProfilePhoto_normal.jpg', NULL)
UPDATE `tweeters` SET `friends_count` = 45, `updated_at` = '2010-06-10 23:02:38' WHERE `id` = 1